:PROPERTIES:
:ID:       F456E71B-7A87-43EB-8BDB-85856E9E136E
:header-args: :results output
:END:
#+title: docker

Docker is a popular containerization tool.

I /may/ be more likely to prefer an alternative - docker for the most
part is built on top of OSS solutions, largely those provided by the
Linux kernel. I therefore have some wariness about docker being a
product that may have conflicting incentives. I've lost track of what
the current state of that ecosystem is so for now I'll continue to
default to docker but with the plan to swap if anything seems amiss.

* Installation

** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :session brew :async
  brew install docker
#+end_src

#+RESULTS:
: brew install docker
: Warning: docker 29.6.1 is already installed and up-to-date.
: To reinstall 29.6.1, run:
:   brew reinstall docker
: [?2004hecho 'ob_comint_async_shell_end_9e1087aa-3751-4923-adb4-e2356fbe5445'[?2004l

* Verification

#+begin_src shell
  docker --version
#+end_src

#+RESULTS:
: Docker version 29.6.1, build 8900f1d330

* Help

#+begin_src shell
  docker --help
#+end_src

#+RESULTS:
#+begin_example
Usage:  docker [OPTIONS] COMMAND

A self-sufficient runtime for containers

Common Commands:
  run         Create and run a new container from an image
  exec        Execute a command in a running container
  ps          List containers
  build       Build an image from a Dockerfile
  pull        Download an image from a registry
  push        Upload an image to a registry
  images      List images
  login       Authenticate to a registry
  logout      Log out from a registry
  search      Search Docker Hub for images
  version     Show the Docker version information
  info        Display system-wide information

Management Commands:
  builder     Manage builds
  container   Manage containers
  context     Manage contexts
  image       Manage images
  manifest    Manage Docker image manifests and manifest lists
  network     Manage networks
  plugin      Manage plugins
  system      Manage Docker
  volume      Manage volumes

Swarm Commands:
  swarm       Manage Swarm

Commands:
  attach      Attach local standard input, output, and error streams to a running container
  commit      Create a new image from a container's changes
  cp          Copy files/folders between a container and the local filesystem
  create      Create a new container
  diff        Inspect changes to files or directories on a container's filesystem
  events      Get real time events from the server
  export      Export a container's filesystem as a tar archive
  history     Show the history of an image
  import      Import the contents from a tarball to create a filesystem image
  inspect     Return low-level information on Docker objects
  kill        Kill one or more running containers
  load        Load an image from a tar archive or STDIN
  logs        Fetch the logs of a container
  pause       Pause all processes within one or more containers
  port        List port mappings or a specific mapping for the container
  rename      Rename a container
  restart     Restart one or more containers
  rm          Remove one or more containers
  rmi         Remove one or more images
  save        Save one or more images to a tar archive (streamed to STDOUT by default)
  start       Start one or more stopped containers
  stats       Display a live stream of container(s) resource usage statistics
  stop        Stop one or more running containers
  tag         Create a tag TARGET_IMAGE that refers to SOURCE_IMAGE
  top         Display the running processes of a container
  unpause     Unpause all processes within one or more containers
  update      Update configuration of one or more containers
  wait        Block until one or more containers stop, then print their exit codes

Global Options:
      --config string      Location of client config files (default
                           "/Users/mwhipple/.docker")
  -c, --context string     Name of the context to use to connect to the
                           daemon (overrides DOCKER_HOST env var and
                           default context set with "docker context use")
  -D, --debug              Enable debug mode
  -H, --host string        Daemon socket to connect to
  -l, --log-level string   Set the logging level ("debug", "info",
                           "warn", "error", "fatal") (default "info")
      --tls                Use TLS; implied by --tlsverify
      --tlscacert string   Trust certs signed only by this CA (default
                           "/Users/mwhipple/.docker/ca.pem")
      --tlscert string     Path to TLS certificate file (default
                           "/Users/mwhipple/.docker/cert.pem")
      --tlskey string      Path to TLS key file (default
                           "/Users/mwhipple/.docker/key.pem")
      --tlsverify          Use TLS and verify the remote
  -v, --version            Print version information and quit

Run 'docker COMMAND --help' for more information on a command.

For more help on how to use Docker, head to https://docs.docker.com/go/guides/
#+end_example

* [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]]

Docker relies on Linux and therefore requires some virtualization help
on macOS. One of the more popular options for this and the one I've
been using for a while now is colima.

** Colima

*** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :session brew :async
  brew install --yes colima
#+end_src

#+RESULTS:
: brew install --yes colima
: ✔︎ JSON API packages.arm64_tahoe.jws.json
: Warning: colima 0.10.3 is already installed and up-to-date.
: To reinstall 0.10.3, run:
:   brew reinstall colima
: [?2004hecho 'ob_comint_async_shell_end_569ed492-740b-4684-82e9-c39a485260da'[?2004l

*** verification

#+begin_src shell
  colima --version
#+end_src

#+RESULTS:
: colima version 0.10.3

*** help

#+begin_src shell
  colima help
#+end_src

#+RESULTS:
#+begin_example
Colima provides container runtimes on macOS with minimal setup.

Usage:
  colima [command]

Available Commands:
  completion  Generate completion script
  delete      delete and teardown Colima
  help        Help about any command
  kubernetes  manage Kubernetes cluster
  list        list instances
  model       manage AI models (requires docker runtime and krunkit VM type)
  nerdctl     run nerdctl (requires containerd runtime)
  prune       prune cached downloaded assets
  restart     restart Colima
  ssh         SSH into the VM
  ssh-config  show SSH connection config
  start       start Colima
  status      show the status of Colima
  stop        stop Colima
  template    edit the template for default configurations
  update      update the container runtime
  version     print the version of Colima

Flags:
  -h, --help             help for colima
  -p, --profile string   profile name, for multiple instances (default "default")
  -v, --verbose          enable verbose log
      --version          version for colima
      --very-verbose     enable more verbose log

Use "colima [command] --help" for more information about a command.
#+end_example
